/**У нас есть константа birthday, а также age, которая вычисляется при помощи некоторого кода, используя значение из birthday 
 * (в данном случае детали не имеют значения, поэтому код не рассматривается).
Можно ли использовать заглавные буквы для имени birthday? А для age? Или одновременно для обеих переменных? */

const birthday = '18.04.1982';
const age = someCode(birthday);

/** Т.к. Мы определили переменную birthday перед выполнением кода то можем использовать заглавные буквы, 
 * переменная age получилась в результате выполнения кода, поэтому мы не можем использовать заглавные буквы в ее названии*/